class Errors:
    file_decode_error = \
        "\nНеудалось декодировать файл. Выберите подходящий файл.\n"
    file_blank_error = \
        "\nФайл пустой. Выберите подходящий файл.\n"
    file_too_big_error = \
        "\nФайл слишком большой. Выберите подходящий файл.\n"
    file_not_supported = \
        "\nФайл не пддерживается программой. Выберите подходящий файл.\n"
    file_not_exhaustive = \
        "\nФайл не является исчерпывающим или не имеет достаточное количество данных. Выберите подходящий файл.\n"

    file_select_error = \
        "\nФайл не был выбран.\n"

    file_upload_error = \
        "\nФайл имеет ошибки. Перепроверьте файл или выберите другой."

    non_viable_number_error = \
        "Не валидный выбор, повторите ввод снова."
    non_integer_input_error = \
        "Введено не целое числовое значение, повторите ввод снова."

    chose_file_error = \
        "\nСначала выберите файл (1).\n"
    upload_file_error = \
        "\nСначала загрузите файл (2).\n"
    chose_region_and_column_error = \
        "\nСначала выберите регион и колонку (3).\n"

    file_upload_fix_error = \
        "\nФайл не поддерживается программой. Исправить файл не удалось. Выберите другой файл.\n"
